# Importing Packages

In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series(['A','B','C','Aaba','Baca',np.nan,'CABA','dog','cat'])

In [3]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [4]:
s.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
dtype: object

In [5]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [7]:
s.str.capitalize()

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    Caba
7     Dog
8     Cat
dtype: object

In [8]:
s.str.len()

0    1.0
1    1.0
2    1.0
3    4.0
4    4.0
5    NaN
6    4.0
7    3.0
8    3.0
dtype: float64

In [9]:
names = pd.Series([' jack','jill ',' jesse ','frank','Ravi Pandey'])

In [11]:
names.str.strip()

0           jack
1           jill
2          jesse
3          frank
4    Ravi Pandey
dtype: object

In [12]:
names.str.lstrip()

0           jack
1          jill
2         jesse
3          frank
4    Ravi Pandey
dtype: object

In [13]:
names.str.rstrip()

0           jack
1           jill
2          jesse
3          frank
4    Ravi Pandey
dtype: object

In [16]:
df = pd.DataFrame(np.random.randn(3,2), columns=[' Column A',' Column B '])

In [17]:
df

    Column A   Column B
0   0.211741   -1.017031
1  -0.596590    1.134723
2  -0.229787    0.049126

In [23]:
df.columns = df.columns.str.strip().str.lower().str.replace(' ','_')

In [24]:
df

   column_a  column_b
0  0.211741 -1.017031
1 -0.596590  1.134723
2 -0.229787  0.049126

In [25]:
s2 = pd.Series(['a_b_c', 'c_d_e', np.nan, 'f_g'])

In [26]:
s2

0    a_b_c
1    c_d_e
2      NaN
3      f_g
dtype: object

In [27]:
s2.str.split('_')

0    [a, b, c]
1    [c, d, e]
2          NaN
3       [f, g]
dtype: object

In [28]:
s2.str.split('_')[0]

['a', 'b', 'c']

In [29]:
s2.str.split('_').get(0)

['a', 'b', 'c']

In [31]:
s2.str.split('_').str[0]

0      a
1      c
2    NaN
3      f
dtype: object

In [32]:
s2.str.split('_').str.get(0)

0      a
1      c
2    NaN
3      f
dtype: object

In [33]:
s2.str.split('_').str.get(2)

0      c
1      e
2    NaN
3    NaN
dtype: object

In [34]:
email = pd.Series(['123@umd.edu','tom@gamil.com','jerry@yahoo.com','jenny@rhsmith.umd.edu'])

In [35]:
email.str.split('@')

0              [123, umd.edu]
1            [tom, gamil.com]
2          [jerry, yahoo.com]
3    [jenny, rhsmith.umd.edu]
dtype: object

In [36]:
username = email.str.split('@').str[0]

In [37]:
username

0      123
1      tom
2    jerry
3    jenny
dtype: object

In [38]:
domain_name = email.str.split('@').str[1]

In [39]:
domain_name

0            umd.edu
1          gamil.com
2          yahoo.com
3    rhsmith.umd.edu
dtype: object

In [40]:
email.str.split('@', expand=True)

       0                1
0    123          umd.edu
1    tom        gamil.com
2  jerry        yahoo.com
3  jenny  rhsmith.umd.edu

In [41]:
email.str.replace('@','#')

0              123#umd.edu
1            tom#gamil.com
2          jerry#yahoo.com
3    jenny#rhsmith.umd.edu
dtype: object

In [42]:
dollars = pd.Series(['$2.15','$3.60','$9.34'])

In [43]:
dollars

0    $2.15
1    $3.60
2    $9.34
dtype: object

In [45]:
dollars.str.replace('$','').astype(float)

0    2.15
1    3.60
2    9.34
dtype: float64

In [48]:
dollars = pd.Series(['$2.15','$334,400.60','$9.34'])

In [49]:
dollars

0          $2.15
1    $334,400.60
2          $9.34
dtype: object

In [51]:
dollars.str.replace('$','').str.replace(',','').astype(float)

0         2.15
1    334400.60
2         9.34
dtype: float64

In [52]:
s1 = pd.Series(['a','b','c'])
s2 = pd.Series(['a','f','g'])

In [53]:
s1.str.cat(s2, sep='_')

0    a_a
1    b_f
2    c_g
dtype: object